; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v13 ?v3)
             (pred_5 ?v11 ?v9)
             (pred_1 ?v13 ?v9)
             (pred_8 ?v7 ?v13 )
	     (pred_2 ?v13)
             (pred_10 ?v10)
             (pred_11 ?v11)
             (pred_4 ?v9)
             (pred_7 ?v13)
             (pred_12 ?v11)
             (pred_9 ?v13)
             (pred_3 ))



(:action op_1
:parameters (?v4 ?v1 ?v5 ?v6)
:precondition (and (pred_10 ?v4) (pred_10 ?v1) (pred_11 ?v5) (pred_4 ?v6)
          (pred_6 ?v4 ?v1) (pred_5 ?v5 ?v6)
                   (pred_1 ?v1 ?v6) (pred_2 ?v4) 
                   (pred_7 ?v1) (pred_12 ?v5))
:effect (and  (pred_9 ?v1) (not (pred_7 ?v1))))


(:action op_5
:parameters (?v4 ?v2)
:precondition (and (pred_10 ?v4) (pred_10 ?v2)
               (pred_2 ?v4) (pred_6 ?v4 ?v2) (pred_9 ?v2))
:effect (and (pred_2 ?v2) (not (pred_2 ?v4))))

(:action op_4
:parameters (?v4 ?v5)
:precondition (and (pred_10 ?v4) (pred_11 ?v5) 
                  (pred_2 ?v4) (pred_8 ?v5 ?v4) (pred_3 ))
:effect (and (pred_12 ?v5)
   (not (pred_8 ?v5 ?v4)) (not (pred_3 ))))


(:action op_3
:parameters (?v4 ?v8 ?v12)
:precondition (and (pred_10 ?v4) (pred_11 ?v8) (pred_11 ?v12)
                  (pred_2 ?v4) (pred_12 ?v12) (pred_8 ?v8 ?v4))
:effect (and (pred_12 ?v8) (pred_8 ?v12 ?v4)
        (not (pred_12 ?v12)) (not (pred_8 ?v8 ?v4))))

(:action op_2
:parameters (?v4 ?v5)
:precondition (and (pred_10 ?v4) (pred_11 ?v5) 
                  (pred_2 ?v4) (pred_12 ?v5))
:effect (and (pred_3 ) (pred_8 ?v5 ?v4) (not (pred_12 ?v5)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_12 obj_13 obj_04 obj_16 obj_06 obj_03 obj_11 obj_10 obj_05 obj_08 obj_20 obj_02 obj_19 obj_01 obj_17 obj_15
    obj_09 obj_14
    obj_07 obj_18
    )

    (:init
       (pred_3)

       (pred_10 obj_12)
       (pred_10 obj_13)
       (pred_10 obj_04)
       (pred_10 obj_16)
       (pred_10 obj_06)
       (pred_10 obj_03)
       (pred_10 obj_11)
       (pred_10 obj_10)
       (pred_10 obj_05)
       (pred_10 obj_08)
       (pred_10 obj_20)
       (pred_10 obj_02)
       (pred_10 obj_19)
       (pred_10 obj_01)
       (pred_10 obj_17)
       (pred_10 obj_15)
       (pred_4 obj_09)
       (pred_4 obj_14)
       (pred_11 obj_07)
       (pred_11 obj_18)

       (pred_6 obj_12 obj_06)
       (pred_6 obj_12 obj_13)
       (pred_6 obj_13 obj_03)
       (pred_6 obj_13 obj_04)
       (pred_6 obj_13 obj_12)
       (pred_6 obj_04 obj_11)
       (pred_6 obj_04 obj_16)
       (pred_6 obj_04 obj_13)
       (pred_6 obj_16 obj_10)
       (pred_6 obj_16 obj_04)
       (pred_6 obj_06 obj_05)
       (pred_6 obj_06 obj_03)
       (pred_6 obj_06 obj_12)
       (pred_6 obj_03 obj_08)
       (pred_6 obj_03 obj_11)
       (pred_6 obj_03 obj_13)
       (pred_6 obj_03 obj_06)
       (pred_6 obj_11 obj_20)
       (pred_6 obj_11 obj_10)
       (pred_6 obj_11 obj_04)
       (pred_6 obj_11 obj_03)
       (pred_6 obj_10 obj_02)
       (pred_6 obj_10 obj_16)
       (pred_6 obj_10 obj_11)
       (pred_6 obj_05 obj_19)
       (pred_6 obj_05 obj_08)
       (pred_6 obj_05 obj_06)
       (pred_6 obj_08 obj_01)
       (pred_6 obj_08 obj_20)
       (pred_6 obj_08 obj_03)
       (pred_6 obj_08 obj_05)
       (pred_6 obj_20 obj_17)
       (pred_6 obj_20 obj_02)
       (pred_6 obj_20 obj_11)
       (pred_6 obj_20 obj_08)
       (pred_6 obj_02 obj_15)
       (pred_6 obj_02 obj_10)
       (pred_6 obj_02 obj_20)
       (pred_6 obj_19 obj_01)
       (pred_6 obj_19 obj_05)
       (pred_6 obj_01 obj_17)
       (pred_6 obj_01 obj_08)
       (pred_6 obj_01 obj_19)
       (pred_6 obj_17 obj_15)
       (pred_6 obj_17 obj_20)
       (pred_6 obj_17 obj_01)
       (pred_6 obj_15 obj_02)
       (pred_6 obj_15 obj_17)
       (pred_7 obj_13)
       (pred_7 obj_04)
       (pred_1  obj_13 obj_09)
       (pred_1  obj_04 obj_14)
       (pred_9 obj_12)
       (pred_9 obj_16)
       (pred_9 obj_06)
       (pred_9 obj_03)
       (pred_9 obj_11)
       (pred_9 obj_10)
       (pred_9 obj_05)
       (pred_9 obj_08)
       (pred_9 obj_20)
       (pred_9 obj_02)
       (pred_9 obj_19)
       (pred_9 obj_01)
       (pred_9 obj_17)
       (pred_9 obj_15)

       (pred_5  obj_07 obj_09)
       (pred_5  obj_18 obj_14)
       (pred_8 obj_07 obj_01)
       (pred_8 obj_18 obj_15)
       (pred_2 obj_17)
    )

    (:goal (and
       (pred_8 obj_07 obj_13)
    ))
(:constraints
  (always (not (pred_2 obj_03)))
)
)

; plan
1. (op_5 obj_17 obj_01)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_01)
   goals met: 0 of 1
2. (op_4 obj_01 obj_07)
   deleted: (pred_8 obj_07 obj_01) (pred_3)
   added: (pred_12 obj_07)
   goals met: 0 of 1
3. (op_5 obj_01 obj_08)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_08)
   goals met: 0 of 1
4. (op_5 obj_08 obj_05)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_05)
   goals met: 0 of 1
5. (op_5 obj_05 obj_06)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_06)
   goals met: 0 of 1
6. (op_5 obj_06 obj_12)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_12)
   goals met: 0 of 1
7. (op_1 obj_12 obj_13 obj_07 obj_09)
   deleted: (pred_7 obj_13)
   added: (pred_9 obj_13)
   goals met: 0 of 1
8. (op_5 obj_12 obj_13)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_13)
   goals met: 0 of 1
9. (op_2 obj_13 obj_07)
   deleted: (pred_12 obj_07)
   added: (pred_3) (pred_8 obj_07 obj_13)
   goals met: 1 of 1
